import pandas as pd
import numpy as np
from scipy.stats import ttest_rel, ttest_ind

n=25
sample1=[i for i in range(n)]
sample2=[i+1 for i in range(n)]
print('парный критерий Стьюдента: p=',ttest_rel(sample1,sample2)[1],sep='')
print('непарный: p=',ttest_ind(sample1,sample2)[1],sep='')

'''для задачи 3:
вариант 1:
[1, 1, 1, 1, -1, 1, 1, 1, 1, 1, 1, -1, -1, 1, -1, -1, -1, 1, -1, -1, 1, 1, -1, 1, 1] 
[-1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1, 1, 1, -1, 1, 1, 1, -1, 1, 1, -1, -1, 1, -1, -1]
вариант 2:
[-50, -50, -50, -50, -50, -50, 50, -50, -50, 50, -50, -50, 50, 50, 50, -50, 50, 50, 50, -50, 50, -50, -50, 50, 50]
[70, 70, 70, 70, 70, 70, -30, 70, 70, -30, 70, 70, -30, -30, -30, 70, -30, -30, -30, 70, -30, 70, 70, -30, -30]'''